{
	"firstName": "Kent",
	"lastName": "Phan",
	"fullName": "Kent Phan",
	"email": "kentphan2000@gmail.com",
	"github": "https://www.github.com/MoltenFuzzy",
	"linkedin": "https://www.linkedin.com/in/kentphan2000/",
	"instagram": "https://www.instagram.com/moltenfuzzy/",
	"resume": "https://drive.google.com/file/d/1VV6QuSfu5Wn8c6751wxKT5QCVxMIDFV-/view?usp=sharing",
	"aboutMe": "My name is Kent and I am a graduate from the University of California, Riverside with a B.S. in Computer Science. I am currently looking for opportunies in the tech industry. \n\n I am a full stack developer with experience in C++, C#, Python, JavaScript/TypeScript, HTML, CSS, and SQL. I am also familiar with React, Node.js, Express.js, MongoDB, PostrgreSQL, and AWS. I am a quick learner and I am always looking to learn new things.",
	"projects": [
		{
			"name": "Kennekt",
			"link": "https://kennekt.me",
			"repo": "https://github.com/MoltenFuzzy/Kennekt",
			"demo": "",
			"image": "https://cdn.discordapp.com/attachments/941208408672067624/1130151681892556841/image.png",
			"description": "A social media platform that allows users to connect with each other through their interests. Users can create posts, comment on posts, and follow other users. More features to be added if I have time.",
			"reflection": "Mainly a side project to learn modern web frameworks such as NextJS using the T3 stack for type safety on both the client and server. It actually started off as Kentan, whiched used a similar type safe stack consisting of Nextjs for the frontend and GraphQL in the backend. Felt as thought GraphQl, specifically TypeGraphQL had too much boilerplate and didn't allow me to build things quickly. Kennekt was a full rewrite of Kentan and a huge improvement on code quality based on what I learned from Kentan. Some other things I learned was how to use AWS S3 to store user images in an s3 bucket, implemented basic authentication, security, and learned SQL for my postgres database. Lots of learning! 😅",
			"technologies": [
				"TypeScript",
				"React",
				"NextJS",
				"tRPC",
				"Prisma",
				"PostgreSQL",
				"AWS S3",
				"TailwindCSS"
			]
		},
		{
			"name": "ApeJobs",
			"link": "",
			"repo": "https://github.com/MoltenFuzzy/ApeJobs",
			"demo": "https://www.youtube.com/watch?v=Q3Z3Q4Z3Z3Q",
			"image": "https://user-images.githubusercontent.com/46156230/172455978-ceceafbc-49da-412a-b2f5-752f96023427.png",
			"description": "Orginally called ScottyJobs, ApeJobs is a job search platform for UCR students that allows users to search for jobs and save them to their profile. Users can also create posts to share with other users. More features to be added if I have time.",
			"reflection": "This was the final project for my CS130(Web Development) class. Our team consisted of 4 people and I learned how to use React and JavaScript to create a modern web application. I also learned how to use MongoDB to store user data and Express.js to build a REST API for our backend. I took part in writing parts of the frontend as well as many of the API endpoints. I also learned how to use GitHub to collaborate with my team members. Overall, I learned a lot from this project and I am proud of what we accomplished. Really grateful to Gabby for leading our team.",
			"technologies": [
				"JavaScript",
				"MongoDB",
				"Express.js",
				"React",
				"Node.js",
				"Material UI",
				"Heroku"
			]
		},
		{
			"name": "Covid Dashboard",
			"link": "",
			"repo": "https://github.com/MoltenFuzzy/Covid-Dashboard",
			"demo": "",
			"image": "https://user-images.githubusercontent.com/46156230/144631247-b714d17f-8008-42c3-875f-4449bf6c827b.png",
			"description": "A dashboard for Covid-19 data that displays the number of cases, deaths, and recoveries for each country. Users can also search for a specific country and view the data for that country.",
			"reflection": "Good memories working with my 3 friends and a grad student. It was my first learn building a full stack application and I learned a lot from this project. I was in charge of the backend of the application, which we used Django and Django Rest Framework to build a REST API. I also learned how to use React because I thought the frontend was a buggy mess so I decided to rewrite the frontend 3 days before the deadline. This was my quarter long project for my CS180(Software Engineering) class and I enjoyed learning about software development techniques with a touch of design patterns.",
			"technologies": [
				"JavaScript",
				"Python",
				"React",
				"Django/Django Rest Framework",
				"React Router",
				"Material UI"
			]
		},
		{
			"name": "InfestationZ",
			"link": "",
			"repo": "https://github.com/MoltenFuzzy/InfestationZ",
			"demo": "https://www.youtube.com/watch?v=Q3Z3Q4Z3Z3Q",
			"image": "https://user-images.githubusercontent.com/46156230/103430666-42e07900-4b7b-11eb-83c7-c7e75f40710b.png",
			"description": "A Zombie Survival game where the player must survive as long as possible against an endless horde of zombies. The player can shoot zombies and pick up weapons. The player can also pick up health packs to heal themselves. The game ends when the player dies.",
			"reflection": "Just 3 friends who built a game. Smart pointer make my life easy.",
			"technologies": ["C++", "SFML"]
		},
		{
			"name": "Graphing Calculator",
			"link": "",
			"repo": "https://github.com/MoltenFuzzy/ApeJobs",
			"demo": "https://www.youtube.com/watch?v=Q3Z3Q4Z3Z3Q",
			"image": "https://i.imgur.com/hJZS2Sy.png",
			"description": "A graphing calculator that allows users to graph functions and perform basic calculations. Users can access previously graphed functions and display them on the graph.",
			"reflection": "Trauma, haha just kidding. This was my final project for my CS003A(Intro to Computer Science II) class. I learned how to use C++ BETTER and SFML to create a graphing calculator. We used many of our data structures we built from scratch within this project such as vectors, linked lists, stacks, and queues. I learned I'm not the most creative person thanks to Ralph 😂.",
			"technologies": ["C++", "SFML"]
		},
		{
			"name": "Scroll of Time",
			"link": "",
			"repo": "",
			"demo": "https://drive.google.com/drive/folders/16-j-HPHc7MAUAPzYnmnTo8eflWoBQpG2?usp=sharing",
			"image": "https://media.discordapp.net/attachments/941208408672067624/1130158268078104582/Studio_Project_V3.gif?width=921&height=518",
			"description": "A 2D dungeon crawler game where the player must defeat enemies and collect items to progress through the game. The player has the ability to swing their sword, shoot blobs, and use parry. The player can also use items such as potions and bombs. The game ends when the player defeats the final boss.",
			"reflection": "I don't have very fond memories of this project. It was mainly my friend and I who worked the most on this project within our 6 man team. Took too large of a scope and we were not able to finish the game. I leveled up my C# and Unity skills, but I decided to purse full stack over game dev. I learned that I don't enjoy working on games as much as I like playing them 😅.",
			"technologies": ["C#", "Unity"]
		}
	]
}
